Revit 2024 API
IFCExtrusionCreationData Constructor
 The default constructor.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public IFCExtrusionCreationData()
Visual Basic
Public Sub New
Visual C++
public:
IFCExtrusionCreationData()
Remarks
 All input data will be considered uninitialized.
See Also
IFCExtrusionCreationData Class
Autodesk.Revit.DB.IFC Namespace